app/Controllers/Admin.php

SELECT *
FROM `invoices`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'
SELECT COUNT(*) AS `numrows`
FROM `cases`
WHERE `status` IN ('open','active')
---
    public function index()
    {
        $invoiceModel = new InvoiceModel();
        $userModel = new UserModel();
        $caseModel = new CaseModel();

        $invoiceRows = $invoiceModel->findAll();
        $pendingInvoices = array_filter($invoiceRows, static fn($row) => in_array($row['payment_status'] ?? '', ['UNPAID', 'PARTIAL'], true));

        return view('admin/dashboard', [
            'title' => 'Admin Console',
            'clientCount' => $userModel->where('role', 'user')->countAllResults(),
            'invoiceCount' => count($invoiceRows),
            'activeCaseCount' => $caseModel->whereIn('status', ['open', 'active'])->countAllResults(),