app/Controllers/Cms.php

    public function index()
    {
        return view('cms/index', [
            'updatesCount' => $this->updates->countAllResults(),
            'publishedCount' => $this->updates->where('status', 'published')->countAllResults(),
            'practiceCount' => $this->practiceAreas->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `practice_areas`

    public function practices()
    {
        return view('cms/practices', ['items' => $this->practiceAreas->orderBy('sort_order', 'ASC')->orderBy('name', 'ASC')->findAll()]);
---
SELECT *
FROM `practice_areas`
ORDER BY `sort_order` ASC, `name` ASC