app/Controllers/Crm.php

SELECT COUNT(*) AS `numrows`
FROM `clients`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `cases`
SELECT COUNT(*) AS `numrows`
FROM `cases`
WHERE `status` IN ('open','active')
SELECT *
FROM `clients`
ORDER BY `id` DESC
 LIMIT 8
SELECT *
FROM `cases`
ORDER BY `id` DESC
 LIMIT 8
---
    public function index()
    {
        $clients = new ClientModel();
        $cases = new CaseModel();
        return view('admin/crm/index', [
            'clientCount' => $clients->countAllResults(),
            'activeClientCount' => $clients->where('status', 'active')->countAllResults(),
            'caseCount' => $cases->countAllResults(),
            'openCaseCount' => $cases->whereIn('status', ['open', 'active'])->countAllResults(),
            'recentClients' => (new ClientModel())->orderBy('id', 'DESC')->findAll(8),
            'recentCases' => (new CaseModel())->orderBy('id', 'DESC')->findAll(8),

SELECT `clients`.*, `users`.`id` AS `portal_user_id`, `users`.`status` AS `portal_status`
FROM `clients`
LEFT JOIN `users` ON `users`.`client_id` = `clients`.`id` AND `users`.`role` = 'user'
ORDER BY `clients`.`id` DESC
---
    public function clients()
    {
        $clients = (new ClientModel())
            ->select('clients.*, users.id AS portal_user_id, users.status AS portal_status')
            ->join('users', 'users.client_id = clients.id AND users.role = \'user\'', 'left')
            ->orderBy('clients.id', 'DESC')->findAll();

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function editClient(int $id)
    {
        $client = (new ClientModel())->find($id);

DELETE FROM `users`
WHERE `client_id` = 1
DELETE FROM `clients`
WHERE `id` IN (1)
---
    public function deleteClient(int $id)
    {
        (new UserModel())->where('client_id', $id)->delete();
        (new ClientModel())->delete($id);