app/Controllers/Site.php

SELECT *
FROM `practice_areas`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
---
    public function index(): string
    {
        $practiceAreas=(new PracticeAreaModel())->where('is_active',1)->orderBy('sort_order','ASC')->findAll();