app/Controllers/Updates.php

SELECT *
FROM `legal_updates`
WHERE `status` = 'published'
ORDER BY `published_at` DESC, `id` DESC
---
    public function index()
    {
        $model = new LegalUpdateModel();
        $updates = $model->where('status', 'published')
            ->orderBy('published_at', 'DESC')
            ->orderBy('id', 'DESC')
            ->findAll();